import React from 'react';
import './rules.scss';

class Rules extends React.Component {

  render() {
    return (
		    <div>
              <h2>Правила</h2>
              <p><b>Квест</b> (англ. quest), или приключенческая игра (англ. adventure game) — один из основных жанров компьютерных игр, представляющий собой интерактивную историю с главным героем, управляемым игроком. Важнейшими элементами игры в жанре квеста являются собственно повествование и исследование мира, а ключевую роль в игровом процессе играют решение головоломок и задач, требующих от игрока умственных усилий. Такие характерные для других жанров компьютерных игр элементы, как бои, экономическое планирование и задачи, требующие от игрока скорости реакции и быстрых ответных действий, в квестах сведены к минимуму или вовсе отсутствуют. Игры, объединяющие в себе характерные признаки квестов и жанра action, выделяют в отдельный жанр — action-adventure. </p>
            </div>
    )
  }
}

export default Rules;